# Taps
tap 'homebrew/cask'
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'
tap 'homebrew/bundle'
tap 'nicoverbruggen/homebrew-cask'



# Binaries
brew 'awscli'
brew 'bash' # Latest Bash version
brew 'bat' # "cat" on steroids
brew 'coreutils' # Those that come with macOS are outdated
brew 'ffmpeg'
brew 'gh'
brew 'git'
brew 'bower'
brew 'svn'
brew 'httpie'
brew 'hub'
brew 'mackup'
brew 'mas' # Mac App Store manager
brew 'pkg-config' # https://github.com/driesvints/dotfiles/issues/20
brew 'stripe/stripe-cli/stripe'
brew 'tree' # List directories in a tree structure
brew 'zlib' # Needed for Memcached

# Spatie Medialibrary
brew 'jpegoptim'
brew 'optipng'
brew 'pngquant'
brew 'svgo'
brew 'gifsicle'

# Development
brew 'php'
brew 'php@8.0'
brew 'php@7.4'
brew 'composer'
brew 'imagemagick'
brew 'libmemcached'
brew 'memcached'
brew 'mysql'
brew 'nginx'
brew 'node'
brew 'node@12'
brew 'node@14'
brew 'redis'
brew 'yarn'
brew 'wp-cli'
brew 'omkatv/powerlevel10k/powerlevel10k'

# Apps
cask '1password'
cask '1password-cli'
cask 'alfred'
cask 'sip'
cask 'bartender'
cask 'stremio'
cask 'caffeine'
cask 'dbngin'
cask 'modern-csv'
cask 'discord'
cask 'firefox'
cask 'github'
cask 'google-backup-and-sync'
cask 'google-chrome'
cask 'insomnia'
cask 'phpstorm'
cask 'skype'
cask 'slack'
cask 'sublime-text'
cask 'tableplus'
cask 'telegram-desktop'
cask 'the-unarchiver'
cask 'tinkerwell'
cask 'transmit'
cask 'cakebrew'
cask 'carbon-copy-cloner'
cask 'cleanshot'
cask 'deepl'
cask 'helo'
cask 'iterm2'
cask 'karabiner-elements'
cask 'notion'
cask 'phpmon'
cask 'ray'
cask 'rectangle'
cask 'sketch'
cask 'sourcetree'
cask 'spotify'
cask 'surfshark'
cask 'toggl-track'
cask 'adobe-creative-cloud'
cask 'dash'


# Quicklook
cask 'qlcolorcode'
cask 'qlmarkdown'
cask 'quicklook-json'
cask 'quicklook-csv'
cask 'qlstephen'

# Fonts
cask 'font-hack-nerd-font'
cask 'font-lato'
cask 'font-open-sans'
cask 'font-roboto'
cask 'font-source-code-pro-for-powerline'
cask 'font-source-code-pro'
cask 'font-source-sans-pro'
cask 'font-source-serif-pro'

# Mac App Store
mas 'Tailscale', id: 1475387142
